---
type: ElectricalDemandFactorValue
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 8
tags: [revit-api, class]
---

# ElectricalDemandFactorValue

`Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElectricalDemandFactorValue | — | `` |
| Constructor | ElectricalDemandFactorValue | 2011 | `public ElectricalDemandFactorValue ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | SetMaxRangeToUnlimited | 2011 | `public void SetMaxRangeToUnlimited ()` |
| Property | Factor | 2011 | `public double Factor { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MaxRange | 2011 | `public double MaxRange { get ; set ; }` |
| Property | MinRange | 2011 | `public double MinRange { get ; set ; }` |